Ran Plan for dir: `eu-central-1/production` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running 'sh -c' '/usr/local/bin/terraform plan -input=false -refresh -out "/home/atlantis/.atlantis/repos/Federated-Engineers/elite-cloud-infrastructures/40/default/eu-central-1/production/default.tfplan"' in '/home/atlantis/.atlantis/repos/Federated-Engineers/elite-cloud-infrastructures/40/default/eu-central-1/production': exit status 1
aws_ecr_repository.elite_airflow: Refreshing state... [id=elite-airflow]
data.aws_ecr_lifecycle_policy_document.elite_airflow: Reading...
data.aws_ssm_parameter.alpen_public_key: Reading...
module.balearic_bucket.aws_s3_bucket.federated-engineers-bucket: Refreshing state... [id=federated-engineers-production-elite-balearic]
module.nordic_peak_bucket.aws_s3_bucket.federated-engineers-bucket: Refreshing state... [id=federated-engineers-production-elite-nordic-peak]
module.injest_bucket.aws_s3_bucket.federated-engineers-bucket: Refreshing state... [id=federated-engineers-production-elite-data-lake]
data.aws_ecr_lifecycle_policy_document.elite_airflow: Read complete after 0s
aws_ecr_lifecycle_policy.elite_airflow: Refreshing state... [id=elite-airflow]
module.balearic_bucket.aws_s3_bucket_versioning.versioning: Refreshing state... [id=federated-engineers-production-elite-balearic]
module.injest_bucket.aws_s3_bucket_versioning.versioning: Refreshing state... [id=federated-engineers-production-elite-data-lake]
module.nordic_peak_bucket.aws_s3_bucket_versioning.versioning: Refreshing state... [id=federated-engineers-production-elite-nordic-peak]
aws_iam_policy.airflow_policy: Refreshing state... [id=arn:aws:iam::049417293525:policy/elite-airflow-access-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_iam_role.sftp_user_role will be created
  + resource "aws_iam_role" "sftp_user_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "transfer.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "sftp_user"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name"        = "alpen_sftp-server"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all              = {
          + "Name"        = "alpen_sftp-server"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_transfer_server.alpen_server will be created
  + resource "aws_transfer_server" "alpen_server" {
      + arn                         = (known after apply)
      + domain                      = "S3"
      + endpoint                    = (known after apply)
      + endpoint_type               = "PUBLIC"
      + force_destroy               = false
      + host_key_fingerprint        = (known after apply)
      + id                          = (known after apply)
      + identity_provider_type      = "SERVICE_MANAGED"
      + protocols                   = [
          + "SFTP",
        ]
      + region                      = "eu-central-1"
      + security_policy_name        = "TransferSecurityPolicy-2018-11"
      + sftp_authentication_methods = (known after apply)
      + tags                        = {
          + "Name"        = "alpen_sftp-server"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }
      + tags_all                    = {
          + "Name"        = "alpen_sftp-server"
          + "environment" = "production"
          + "team"        = "Elite-Data-Engineers"
          + "terraform"   = "true"
        }

      + protocol_details (known after apply)

      + s3_storage_options (known after apply)
    }

  # module.sftp_bucket.aws_s3_bucket.federated-engineers-bucket will be created
  + resource "aws_s3_bucket" "federated-engineers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "federated-engineers-production-elite-sftp-server"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name"        = "federated-engineers-production-elite-sftp-server"
          + "Service"     = "airflow"
          + "environment" = "production"
          + "team"        = "elite"
          + "terraform"   = "true"
        }
      + tags_all                    = {
          + "Name"        = "federated-engineers-production-elite-sftp-server"
          + "Service"     = "airflow"
          + "environment" = "production"
          + "team"        = "elite"
          + "terraform"   = "true"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.sftp_bucket.aws_s3_bucket_versioning.versioning will be created
  + resource "aws_s3_bucket_versioning" "versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-central-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Disabled"
        }
    }

Plan: 4 to add, 0 to change, 0 to destroy.
╷
│ Error: expected length of bucket to be in the range (0 - 63), got federated-engineers-production-Elite-Data-Engineers-alpen_sftp-server
│ 
│   with aws_s3_bucket.federated-engineers-bucket,
│   on alpen_sftp.tf line 2, in resource "aws_s3_bucket" "federated-engineers-bucket":
│    2:   bucket = "federated-engineers-${var.environment}-${var.team}-${var.bucket-use-case}"
│ 
╵
╷
│ Error: reading SSM Parameter (/production/elite/alpen_mechaniks/sftp_server/alpen_ssh_keys.pub): couldn't find resource
│ 
│   with data.aws_ssm_parameter.alpen_public_key,
│   on alpen_sftp.tf line 94, in data "aws_ssm_parameter" "alpen_public_key":
│   94: data "aws_ssm_parameter" "alpen_public_key" {
│ 
╵

```
</details>